#+TITLE: October 5, 2017 - October 20, 2017
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
| TODO | NEXT | IN_PROGRESS                                 | WAITING | DONE | CANCELED |
|------+------+---------------------------------------------+---------+------+----------|
|      |      | READ.1508418323. Read on Kubernetes Part II |         |      |          |
|      |      | READ.1508418128. Read on BDD                |         |      |          |
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
| NAME      | ESTIMATED | ACTUAL | DONE | REMAINING | PENCILS DOWN | PROGRESS   |
|-----------+-----------+--------+------+-----------+--------------+------------|
| Bhavin192 |         5 |      0 |    0 |         5 |   2017-11-13 | ---------- |
| Ashwanig  |       2.0 |      0 |    0 |       2.0 |   2017-10-20 | ---------- |
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:0]"
#+BEGIN: block-update-burndown
| DAY | DATE | ACTUAL | IDEAL | TASKS COMPLETED |
|-----+------+--------+-------+-----------------|
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
| ITEM                       | TASKID          | OWNER     | PRIORITY | TODO        | ESTIMATED | ACTUAL |
|----------------------------+-----------------+-----------+----------+-------------+-----------+--------|
| TASKS                      |                 |           | B        |             |       7.0 |        |
|----------------------------+-----------------+-----------+----------+-------------+-----------+--------|
| Read on Kubernetes Part II | READ.1508418323 | bhavin192 | B        | IN_PROGRESS |         5 |        |
|----------------------------+-----------------+-----------+----------+-------------+-----------+--------|
| Read on BDD                | READ.1508418128 | ashwanig  | B        | IN_PROGRESS |       2.0 |        |
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH:
  :SPRINTSTART:
  :wpd-ashwanig: 6
  :wpd-bhavin192: 0.3
  :END:
** IN_PROGRESS Read on Kubernetes Part II
   :PROPERTIES:
   :ESTIMATED: 5
   :ACTUAL:
   :OWNER: bhavin192
   :ID: READ.1508418323
   :TASKID: READ.1508418323
   :END:
   :LOGBOOK:
   CLOCK: [2017-10-10 Tue 19:25]--[2017-10-10 Tue 19:50] =>  0:25
   CLOCK: [2017-10-09 Mon 21:55]--[2017-10-09 Mon 22:27] =>  0:32
   CLOCK: [2017-10-08 Sun 21:56]--[2017-10-08 Sun 22:20] =>  0:24
   CLOCK: [2017-10-07 Sat 23:08]--[2017-10-07 Sat 23:31] =>  0:23
   CLOCK: [2017-10-06 Fri 12:30]--[2017-10-06 Fri 12:45] =>  0:15
   CLOCK: [2017-10-05 Thu 15:55]--[2017-10-05 Thu 16:12] =>  0:17
   :END:
** IN_PROGRESS Read on BDD
   :PROPERTIES:
   :ESTIMATED: 2.0
   :ACTUAL:
   :OWNER: ashwanig
   :ID: READ.1508418128
   :TASKID: READ.1508418128
   :END:
   :LOGBOOK:
   CLOCK:  [2017-10-07 Sat 11:00]--[2017-10-07 Sat 12:03] =>  1:03
   :END:
